selenium/feature_tests/src/test/resources/testfiles/genricReportingUAE/importSuccess.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cxf="http://cxf.component.camel.apache.org/">
    <soapenv:Header />
    <soapenv:Body>
        <n1:envelope xmlns:n1="http://www.sap.com/sap_ich4ls/" xmlns:prx="urn:sap.com:proxy:Y21:/1SAI/TAS8FB8FF2B37F00B51AA2D:740" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
            <message date="2022-07-14" time="07:53:37">
                <id>42010AEECDE11EDD8D98936BE6F3A1EE</id>
            </message>
            <sender agency="GS1" scheme="GLN">0355801000002</sender>
            <recipients>
                <id agency="SAP" scheme="RegReport">RR_SA_ICH_IMPORT</id>
            </recipients>
            <content encoding="XML" format="ATTP" type="GenericReporting" version="1.0">
                <ATTPGRDocument>
                    <GRHeader>
                        <GRHeaderBase>
                            <ReceiverId>ReceiverId</ReceiverId>
                            <InstanceId>InstanceID</InstanceId>
                            <DateTime>2022-09-23T12:30:22Z</DateTime>
                            <VariantName>RR_SA_IMPORT</VariantName>
                            <VariantVersion>1</VariantVersion>
                        </GRHeaderBase>
                        <ContentList>
                            <Content type="Event">
                                <ContentItem id="1-OBSERVE">
                                    <ContentItemSection type="Details">
                                        <ContentItemSectionItem>
                                            <attribute id="sttpEvtReadpntGln">0355801000002</attribute>
                                        </ContentItemSectionItem>
                                    </ContentItemSection>
                                </ContentItem>
                            </Content>
                        </ContentList>
                    </GRHeader>
                    <GRBody>
                        <ObjContentList>
                            <ObjContent type="LotRefList">
                                <ObjContentGroup>
                                    <ObjCode id="010406397300099210DKSA010801" type="LGTIN" dateManuf="2022-09-23" dateExp="2023-09-23" />
                                </ObjContentGroup>
                            </ObjContent>
                            <ObjContent type="SGTINList">
                                <ObjContentGroup>
                                    <ObjCode id="objcode1" type="SGTIN" lotRef="SFDAQOSAIBI1817" />
                                    <ObjCode id="objcode2" type="SGTIN" lotRef="SFDAQOSAIBI1817" />
                                </ObjContentGroup>
                            </ObjContent>
                        </ObjContentList>
                    </GRBody>
                </ATTPGRDocument>
            </content>
        </n1:envelope>
    </soapenv:Body>
</soapenv:Envelope>